IOsetting/py32f0-template/Misc/py32f002axx.svd
				<register>
					<name>BRR</name>
					<displayName>BRR</displayName>
					<description>port bit reset register</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>BR8</name>
							<description>Port Reset bit</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR7</name>
							<description>Port Reset bit</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR6</name>
							<description>Port Reset bit</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR5</name>
							<description>Port Reset bit</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR4</name>
							<description>Port Reset bit</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR3</name>
							<description>Port Reset bit</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR2</name>
							<description>Port Reset bit</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR1</name>
							<description>Port Reset bit</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR0</name>
							<description>Port Reset bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral derivedFrom="GPIOB">
			<name>GPIOF</name>
			<baseAddress>0x50001400</baseAddress>
		</peripheral>
		<peripheral>
			<name>EXTI</name>
			<description>External interrupt/event
			controller</description>
			<groupName>EXTI</groupName>
			<baseAddress>0x40021800</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>EXTI0_1</name>
				<description>EXTI Line 0 and 1 Interrupt</description>
				<value>5</value>
			</interrupt>
			<interrupt>
				<name>EXTI2_3</name>
				<description>EXTI Line 2 and 3 Interrupt</description>
				<value>6</value>
			</interrupt>
			<interrupt>
				<name>EXTI4_15</name>
				<description>EXTI Line 4 to 15 Interrupt</description>
				<value>7</value>
			</interrupt>
			<registers>
				<register>
					<name>RTSR</name>
					<displayName>RTSR</displayName>
					<description>EXTI rising trigger selection
					register</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RT18</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RT17</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RT16</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RT15</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RT14</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RT13</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RT12</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RT11</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RT10</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RT9</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RT8</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RT7</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RT6</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RT5</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RT4</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RT3</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RT2</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RT1</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RT0</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>FTSR</name>
					<displayName>FTSR</displayName>
					<description>EXTI falling trigger selection
					register</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FT18</name>
							<description>Falling trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FT17</name>
							<description>Falling trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FT16</name>
							<description>Falling trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FT15</name>
							<description>Falling trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FT14</name>
							<description>Falling trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FT13</name>
							<description>Falling trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FT12</name>
							<description>Falling trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FT11</name>
							<description>Falling trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FT10</name>
							<description>Falling trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FT9</name>
							<description>Falling trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FT8</name>
							<description>Falling trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FT7</name>
							<description>Falling trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FT6</name>
							<description>Falling trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FT5</name>
							<description>Falling trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FT4</name>
							<description>Falling trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FT3</name>
							<description>Falling trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FT2</name>
							<description>Falling trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FT1</name>
							<description>Falling trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FT0</name>
							<description>Falling trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SWIER</name>
					<displayName>SWIER</displayName>
					<description>EXTI software interrupt event
					register</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SWI18</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWI17</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWI16</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWI15</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWI14</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWI13</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWI12</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWI11</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWI10</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWI9</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWI8</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWI7</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWI6</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWI5</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWI4</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWI3</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWI2</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWI1</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWI0</name>
							<description>Rising trigger event configuration bit
							of Configurable Event input</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>PR</name>
					<displayName>PR</displayName>
					<description>EXTI  pending
					register</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PR18</name>
							<description>configurable event inputs x rising edge
							Pending bit.</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PR17</name>
							<description>configurable event inputs x rising edge
							Pending bit.</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PR16</name>
							<description>configurable event inputs x rising edge
							Pending bit.</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PR15</name>
							<description>configurable event inputs x rising edge
							Pending bit.</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PR14</name>
							<description>configurable event inputs x rising edge
							Pending bit.</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PR13</name>
							<description>configurable event inputs x rising edge
							Pending bit</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PR12</name>
							<description>configurable event inputs x rising edge
							Pending bit.</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PR11</name>
							<description>configurable event inputs x rising edge
							Pending bit.</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PR10</name>
							<description>configurable event inputs x rising edge
							Pending bit.</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PR9</name>
							<description>configurable event inputs x rising edge
							Pending bit.</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PR8</name>
							<description>configurable event inputs x rising edge
							Pending bit.</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PR7</name>
							<description>configurable event inputs x rising edge
							Pending bit.</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PR6</name>
							<description>configurable event inputs x rising edge
							Pending bit.</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PR5</name>
							<description>configurable event inputs x rising edge
							Pending bit.</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PR4</name>
							<description>configurable event inputs x rising edge
							Pending bit.</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PR3</name>
							<description>configurable event inputs x rising edge
							Pending bit.</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PR2</name>
							<description>configurable event inputs x rising edge
							Pending bit.</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PR1</name>
							<description>configurable event inputs x rising edge
							Pending bit.</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PR0</name>
							<description>configurable event inputs x rising edge
							Pending bit.</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EXTICR1</name>
					<displayName>EXTICR1</displayName>
					<description>EXTI external interrupt selection
					register</description>
					<addressOffset>0x60</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EXTI3</name>
							<description>GPIO port selection</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>EXTI2</name>
							<description>GPIO port selection</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>EXTI1</name>
							<description>GPIO port selection</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>EXTI0</name>
							<description>GPIO port selection</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EXTICR2</name>
					<displayName>EXTICR2</displayName>
					<description>EXTI external interrupt selection
					register</description>
					<addressOffset>0x64</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EXTI7</name>
							<description>GPIO port selection</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXTI6</name>
							<description>GPIO port selection</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXTI5</name>
							<description>GPIO port selection</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXTI4</name>
							<description>GPIO port selection</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
