IOsetting/py32f0-template/Misc/py32f002axx.svd
				</registers>
		</peripheral>
		<peripheral>
				<name>TIM16</name>
				<description>General purpose timer</description>
				<groupName>TIM</groupName>
				<baseAddress>0x40014400</baseAddress>
				<addressBlock>
					<offset>0x00</offset>
					<size>0x400</size>
					<usage>registers</usage>
				</addressBlock>
				<interrupt>
					<name>TIM16</name>
					<description>TIM16 global Interrupt</description>
					<value>21</value>
				</interrupt>
				<registers>
					<register>
						<name>CR1</name>
						<displayName>CR1</displayName>
						<description>TIM16 control register1</description>
						<addressOffset>0x0</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x0000</resetValue>
						<fields>
							<field>
								<name>CKD</name>
								<description>Prescaler factor</description>
								<bitOffset>8</bitOffset>
								<bitWidth>2</bitWidth>
							</field>
							<field>
								<name>ARPE</name>
								<description>Auto-reload preload enable</description>
								<bitOffset>7</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>OPM</name>
								<description>One pulse mode</description>
								<bitOffset>3</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>URS</name>
								<description>Update request source</description>
								<bitOffset>2</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>UDIS</name>
								<description>Update disable</description>
								<bitOffset>1</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CEN</name>
								<description>Counter enable</description>
								<bitOffset>0</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>DIER</name>
						<displayName>DIER</displayName>
						<description>DMA/Interrupt enable register</description>
						<addressOffset>0xC</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x0000</resetValue>
						<fields>
							<field>
								<name>UIE</name>
								<description>Update interrupt enable</description>
								<bitOffset>0</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>SR</name>
						<displayName>SR</displayName>
						<description>status register</description>
						<addressOffset>0x10</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x0000</resetValue>
						<fields>
							<field>
								<name>UIF</name>
								<description>Update interrupt flag</description>
								<bitOffset>0</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>EGR</name>
						<displayName>EGR</displayName>
						<description>event generation register</description>
						<addressOffset>0x14</addressOffset>
						<size>0x20</size>
						<access>write-only</access>
						<resetValue>0x0000</resetValue>
						<fields>
							<field>
								<name>UG</name>
								<description>Update generation</description>
								<bitOffset>0</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>CNT</name>
						<displayName>CNT</displayName>
						<description>counter</description>
						<addressOffset>0x24</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x00000000</resetValue>
						<fields>
							<field>
								<name>CNT</name>
								<description>counter value</description>
								<bitOffset>0</bitOffset>
								<bitWidth>16</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>PSC</name>
						<displayName>PSC</displayName>
						<description>prescaler</description>
						<addressOffset>0x28</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x0000</resetValue>
						<fields>
							<field>
								<name>PSC</name>
								<description>Prescaler value</description>
								<bitOffset>0</bitOffset>
								<bitWidth>16</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>ARR</name>
						<displayName>ARR</displayName>
						<description>auto-reload register</description>
						<addressOffset>0x2C</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x00000000</resetValue>
						<fields>
							<field>
								<name>ARR</name>
								<description>Auto-reload value</description>
								<bitOffset>0</bitOffset>
								<bitWidth>16</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>RCR</name>
						<displayName>RCR</displayName>
						<description>repetition counter register</description>
						<addressOffset>0x30</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x0000</resetValue>
						<fields>
							<field>
								<name>REP</name>
								<description>Repetition counter value</description>
								<bitOffset>0</bitOffset>
								<bitWidth>8</bitWidth>
							</field>
						</fields>
					</register>
				</registers>
		</peripheral>
		<peripheral>
				<name>SYSCFG</name>
				<description>System configuration controller</description>
				<groupName>SYSCFG</groupName>
				<baseAddress>0x40010000</baseAddress>
				<addressBlock>
					<offset>0x0</offset>
					<size>0x30</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>CFGR1</name>
						<displayName>CFGR1</displayName>
						<description>SYSCFG configuration register
						1</description>
						<addressOffset>0x0</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x00000000</resetValue>
						<fields>
							<field>
								<name>I2C_PF1_ANF</name>
								<description> Analog filter enable control driving capability
								activation bits PF1</description>
								<bitOffset>30</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>I2C_PF0_ANF</name>
								<description> Analog filter enable control driving capability
								activation bits PF0</description>
								<bitOffset>29</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>I2C_PB8_ANF</name>
								<description> Analog filter enable control driving capability
								activation bits PB8</description>
								<bitOffset>28</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>I2C_PB7_ANF</name>
								<description> Analog filter enable control driving capability
								activation bits PB7</description>
								<bitOffset>27</bitOffset>
								<bitWidth>1</bitWidth>
							</field><field>
								<name>I2C_PB6_ANF</name>
								<description> Analog filter enable control driving capability
								activation bits PB6</description>
								<bitOffset>26</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>I2C_PA12_ANF</name>
								<description> Analog filter enable control driving capability
								activation bits PA12</description>
								<bitOffset>25</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>I2C_PA11_ANF</name>
								<description> Analog filter enable control driving capability
								activation bits PA11</description>
								<bitOffset>24</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>I2C_PA10_ANF</name>
								<description> Analog filter enable control driving capability
								activation bits PA10</description>
								<bitOffset>23</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>I2C_PA9_ANF</name>
								<description> Analog filter enable control driving capability
								activation bits PA9</description>
								<bitOffset>22</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>I2C_PA8_ANF</name>
								<description> Analog filter enable control driving capability
								activation bits PA8</description>
								<bitOffset>21</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>I2C_PA7_ANF</name>
								<description> Analog filter enable control driving capability
								activation bits PA7</description>
								<bitOffset>20</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>I2C_PA3_ANF</name>
								<description> Analog filter enable control driving capability
								activation bits PA3</description>
								<bitOffset>19</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>I2C_PA2_ANF</name>
								<description> Analog filter enable control driving capability
								activation bits PA2</description>
								<bitOffset>18</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>MEM_MODE</name>
								<description>Memory mapping selection
								bits</description>
								<bitOffset>0</bitOffset>
								<bitWidth>2</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>CFGR2</name>
						<displayName>CFGR2</displayName>
						<description>SYSCFG configuration register
						2</description>
						<addressOffset>0x18</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x00000000</resetValue>
						<fields>
							<field>
								<name>ETR_SRC_TIM1</name>
								<description>TIM1 ETR source selection</description>
								<bitOffset>9</bitOffset>
								<bitWidth>2</bitWidth>
							</field>
							<field>
								<name>LOCKUP_LOCK</name>
								<description>Cortex-M0+ LOCKUP bit enable
								bit</description>
								<bitOffset>0</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
						</fields>
					</register>
